Autodesk.Revit.DB.Family.LoadFamilyX(Autodesk.Revit.DB.Document,System.String,System.Collections.Generic.IDictionary{System.String,System.String},System.Collections.Generic.IDictionary{System.String,System.String}@)
Loads a family. Displays the standard Revit dialogs when overwriting a family. If a
text type catalog is found, displays the standard dialog for family type selection.
document:
The document to load the family into.
filename:
The file from which to load the family.
extraJournalDataOut:
Data that can be used for journal replay. Ignorable. Both In and Out ExtJournalData objects can be the same thing.
Returns:
True if the family was loaded successfully, false otherwise
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020.1

Autodesk.Revit.DB.Family.CanLoadFamilies(Autodesk.Revit.DB.Document)
Checks whether the document is in a state that allows the loading of families.
document:
The document to check.
Returns:
True if loading of families is allowed, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020.1